In [1]:
import pandas as pd
sets=pd.Series([2,52,41,30,81,12,0], index=['mon','tue','wed','thu','fri','sat','sun'],name='Weekly Sales')
print('thu' in sets)

True

In [4]:
sets[sets>40]

tue    52
wed    41
fri    81
Name: Weekly Sales, dtype: int64

In [6]:
dics={'Karachi':500,'Lahore':200,'Islamabad':75}
dic1= pd.Series(dics)
dic1.index

Index(['Karachi', 'Lahore', 'Islamabad'], dtype='object')

In [2]:
import numpy as np
dics2 = pd.Series(dics,index=['Karachi','Hyderabad','Pishawar'], name='Set1') 
print(dics2.isnull())
print(pd.isnull(dics2))

NameError: name 'dics' is not defined

In [13]:
sets.index.name="Face"
sets

Face
mon     2
tue    52
wed    41
thu    30
fri    81
sat    12
sun     0
Name: Weekly Sales, dtype: int64

In [15]:
shop=pd.Series(['600.rs','1600.rs','6100.rs','12000.rs'], index=['Skirt','2 Piece Suit','Pent and Cort','Hot piece suit'], name='My Shop')
display(shop)
shop.index=['Suit 1','Suit 2','Suit 3','Suit 4']
display(shop)

Skirt               600.rs
2 Piece Suit       1600.rs
Pent and Cort      6100.rs
Hot piece suit    12000.rs
Name: My Shop, dtype: object

Suit 1      600.rs
Suit 2     1600.rs
Suit 3     6100.rs
Suit 4    12000.rs
Name: My Shop, dtype: object

In [20]:
'Suit 3' in shop

True

In [21]:
s1=pd.Series([70,50,110,60],index=['Karachi','Lahore','Khairpur','Kashmir'], name='Orange')
s2=pd.Series([100,80,130,50],index=['Karachi','Lahore','Khairpur','Kashmir'],name='Apple')
fruit=[s1,s2]
display(pd.DataFrame(fruit))
sets={'State':['Sindh','Punjab','Balochistan','KPK','Kashmir'],
      'GDP' :[3.9,5.4,4.6,6.1,4.1],
      'No of People' :['40 Million','55 Million','31 Million','25 Million','17 Million']}
display(pd.DataFrame(sets))
display(pd.DataFrame(sets,index=['ID 1','ID 2','ID 3','ID 4','ID 5']))

        Karachi  Lahore  Khairpur  Kashmir
Orange       70      50       110       60
Apple       100      80       130       50

         State  GDP No of People
0        Sindh  3.9   40 Million
1       Punjab  5.4   55 Million
2  Balochistan  4.6   31 Million
3          KPK  6.1   25 Million
4      Kashmir  4.1   17 Million

            State  GDP No of People
ID 1        Sindh  3.9   40 Million
ID 2       Punjab  5.4   55 Million
ID 3  Balochistan  4.6   31 Million
ID 4          KPK  6.1   25 Million
ID 5      Kashmir  4.1   17 Million

In [28]:
set1=pd.DataFrame(fruit)
set1.columns

RangeIndex(start=0, stop=4, step=1)

In [4]:
tab = pd.DataFrame(sets,index=['ID 1','ID 2','ID 3','ID 4','ID 5'],columns=['No of People','State','GDP','Rating'])


import numpy as np
display(tab)
new_val= np.arange(len(tab))
tab.Rating=new_val
display(tab)

     No of People State  GDP Rating
ID 1          NaN   NaN  NaN    NaN
ID 2          NaN   NaN  NaN    NaN
ID 3          NaN   NaN  NaN    NaN
ID 4          NaN   NaN  NaN    NaN
ID 5          NaN   NaN  NaN    NaN

     No of People State  GDP  Rating
ID 1          NaN   NaN  NaN       0
ID 2          NaN   NaN  NaN       1
ID 3          NaN   NaN  NaN       2
ID 4          NaN   NaN  NaN       3
ID 5          NaN   NaN  NaN       4

In [43]:
table=pd.DataFrame(np.random.randn(4,3), columns=list('tre'),index=['1st','2nd','3rd','4th',])
table

            t         r         e
1st  1.286012  1.221670  1.100965
2nd -0.524313 -0.394300 -0.207034
3rd  1.176098 -1.605894  0.701452
4th -0.964084 -0.360648 -0.939200

In [50]:
print(table)
print(table.apply(lambda x: x.max()-x.min()))
print(table.apply(lambda x: x.max()-x.min(), axis=1))

            t         r         e
1st  1.286012  1.221670  1.100965
2nd -0.524313 -0.394300 -0.207034
3rd  1.176098 -1.605894  0.701452
4th -0.964084 -0.360648 -0.939200
t    2.250096
r    2.827564
e    2.040165
dtype: float64
1st    0.185048
2nd    0.317279
3rd    2.781993
4th    0.603436
dtype: float64

In [52]:
def min_max(x):
    
    return pd.Series( [x.min(),x.max()], index=['min','max'] )
n=table.apply(min_max())
print(n,type(n))

ValueError: no results

In [57]:
set1=pd.DataFrame(np.arange(16).reshape(4,4), index=['two','four','one','three'], columns=list('cdab'))
display(set1)
display(set1.sort_index(axis=1, ascending=True))
display(set1.sort_index(axis=0, ascending=False))

        c   d   a   b
two     0   1   2   3
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15

        a   b   c   d
two     2   3   0   1
four    6   7   4   5
one    10  11   8   9
three  14  15  12  13

        c   d   a   b
two     0   1   2   3
three  12  13  14  15
one     8   9  10  11
four    4   5   6   7

In [63]:
display(set1.sort_values(by='four',axis=1))

        c   d   a   b
two     0   1   2   3
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15

In [72]:
sum(set1.d.value_counts())
set1.c.unique()

array([ 0,  4,  8, 12], dtype=int64)

In [27]:
pds=pd.DataFrame(np.random.randn(5,5),columns=list('pakis'))
f = lambda y: y.max()-y.min()
type(pds.apply(f))
pds

          p         a         k         i         s
0 -0.637108 -0.414288 -0.590399  0.347882  0.319792
1 -0.057765  0.568529  0.607460 -2.640745 -1.172882
2  0.479799  0.856755 -2.650596 -2.558936  0.551289
3 -1.201275 -1.883131  0.189899  0.389114 -0.465990
4  0.336417 -2.174697 -0.514207  1.880295 -1.854116

In [36]:
print(pds.sort_values(by='a', ascending=False))
print(pds.rank(method='max'))
pds.a.value_counts()

          p         a         k         i         s
2  0.479799  0.856755 -2.650596 -2.558936  0.551289
1 -0.057765  0.568529  0.607460 -2.640745 -1.172882
0 -0.637108 -0.414288 -0.590399  0.347882  0.319792
3 -1.201275 -1.883131  0.189899  0.389114 -0.465990
4  0.336417 -2.174697 -0.514207  1.880295 -1.854116
     p    a    k    i    s
0  2.0  3.0  2.0  3.0  4.0
1  3.0  4.0  5.0  1.0  2.0
2  5.0  5.0  1.0  2.0  5.0
3  1.0  2.0  4.0  4.0  3.0
4  4.0  1.0  3.0  5.0  1.0

-2.174697    1
-1.883131    1
 0.856755    1
 0.568529    1
-0.414288    1
Name: a, dtype: int64

In [41]:
s = pd.Series(range(3), index=[0,3,5])
print(s.reindex(range(8)))
print(s.reindex(range(8),method='ffill'))

0    0.0
1    NaN
2    NaN
3    1.0
4    NaN
5    2.0
6    NaN
7    NaN
dtype: float64
0    0
1    0
2    0
3    1
4    1
5    2
6    2
7    2
dtype: int64

In [84]:
import numpy as np
x=np.random.random((64,3,32,10))
y=np.random.random((32,10))
def naive_vector_dot(x,y):
    assert len(x.shape) ==1
    assert len(y.shape) ==1
    assert x.shape[0]==y.shape[0]
    z=0
    for i in range(x.shape[0]):
        z+=x[i]*y[i]
    return z
print(x.shape)
print(y.shape)

(64, 3, 32, 10)
(32, 10)

In [83]:
naive_vector_dot(x,y)

AssertionError:

In [94]:
set1 = pd.DataFrame(np.arange(16).reshape(4,4), columns=['One','Two','Three','Four'])
set2 = pd.DataFrame(np.arange(12).reshape(3,4), columns=['Two','Three','Four','Five'])
sets=set2.add(set1)
sets

   Five  Four  One  Three   Two
0   NaN   5.0  NaN    3.0   1.0
1   NaN  13.0  NaN   11.0   9.0
2   NaN  21.0  NaN   19.0  17.0
3   NaN   NaN  NaN    NaN   NaN

In [104]:
dates = pd.date_range('5/5/2017',periods=50)
dates=pd.DataFrame(dates)
dates.to_csv('dates.csv')